artillery.yml
config:
  target: 'http://localhost:8010'
  phases:
    - pause : 10
    - duration: 5
      arrivalRate: 10
      rampTo: 50
      name: "50 users"
    - duration: 10
      arrivalRate: 20
      rampTo: 200
      name: "200 users"
    - duration: 10
      arrivalRate: 40
      rampTo: 400
      name: "400 users"
    - duration: 5
      arrivalRate: 2000
      name: "jitter traffic"
scenarios:
  - name: "Main"
    flow:
      - post:
          url: "/rides"
          json:
            start_lat: 0
            start_long: 0
            end_lat: 0
            end_long: 0
            rider_name: "Rider Name"
            driver_name: "Driver Name"
            driver_vehicle: "volvo"
          capture:
            json: "$.rideID"
            as: "id"
      - get:
          url: "/rides/{{ id }}"
  - name: "get All"
    flow:
      - get:
          url: "/rides"
          qs:
            page: 1